---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.NoEligibleElementsInAssembly
source: html/ed16b5ab-51ad-6ae2-927c-3f51e3a0e9a4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.NoEligibleElementsInAssembly Property

No eligible elements in assembly.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoEligibleElementsInAssembly { get; }
```